7767517
92 92
Input            Mfcc:0                   0 1 Mfcc:0
MemoryData       DS-CNN/fc1/biases:0      0 1 DS-CNN/fc1/biases:0 0=4
MemoryData       DS-CNN/conv_ds_4/pw_conv/biases:0 0 1 DS-CNN/conv_ds_4/pw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_4/dw_conv/biases:0 0 1 DS-CNN/conv_ds_4/dw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_3/pw_conv/biases:0 0 1 DS-CNN/conv_ds_3/pw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_3/dw_conv/biases:0 0 1 DS-CNN/conv_ds_3/dw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_2/pw_conv/biases:0 0 1 DS-CNN/conv_ds_2/pw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_2/dw_conv/biases:0 0 1 DS-CNN/conv_ds_2/dw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_1/pw_conv/biases:0 0 1 DS-CNN/conv_ds_1/pw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_ds_1/dw_conv/biases:0 0 1 DS-CNN/conv_ds_1/dw_conv/biases:0 0=64
MemoryData       DS-CNN/conv_1/biases:0   0 1 DS-CNN/conv_1/biases:0 0=64
Reshape          Reshape                  1 1 Mfcc:0 Reshape:0 0=990
Reshape          Reshape_1                1 1 Reshape:0 Reshape_1:0 0=1 1=10 2=99
Permute          DS-CNN/conv_1/Conv2D__7  1 1 Reshape_1:0 DS-CNN/conv_1/Conv2D__7:0 0=4
Convolution      DS-CNN/conv_1/Conv2D     1 1 DS-CNN/conv_1/Conv2D__7:0 DS-CNN/conv_1/Conv2D:0 0=64 1=4 11=10 2=1 12=1 3=2 13=2 4=1 14=4 15=1 16=5 5=0 6=2560
Permute          DS-CNN/conv_1/Conv2D__8  1 1 DS-CNN/conv_1/Conv2D:0 DS-CNN/conv_1/Conv2D__8:0 0=3
BinaryOp         DS-CNN/conv_1/BiasAdd    2 1 DS-CNN/conv_1/Conv2D__8:0 DS-CNN/conv_1/biases:0 DS-CNN/conv_1/BiasAdd:0 0=0
Permute          DS-CNN/conv_1/batch_norm/FusedBatchNorm__9 1 1 DS-CNN/conv_1/BiasAdd:0 DS-CNN/conv_1/batch_norm/FusedBatchNorm__9:0 0=4
BatchNorm        DS-CNN/conv_1/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_1/batch_norm/FusedBatchNorm__9:0 DS-CNN/conv_1/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_1/batch_norm/FusedBatchNorm__10 1 1 DS-CNN/conv_1/batch_norm/FusedBatchNorm:0 DS-CNN/conv_1/batch_norm/FusedBatchNorm__10:0 0=3
ReLU             DS-CNN/conv_1/batch_norm/Relu 1 1 DS-CNN/conv_1/batch_norm/FusedBatchNorm__10:0 DS-CNN/conv_1/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_1/dw_conv/depthwise__11 1 1 DS-CNN/conv_1/batch_norm/Relu:0 DS-CNN/conv_ds_1/dw_conv/depthwise__11:0 0=4
ConvolutionDepthWise DS-CNN/conv_ds_1/dw_conv/depthwise 1 1 DS-CNN/conv_ds_1/dw_conv/depthwise__11:0 DS-CNN/conv_ds_1/dw_conv/depthwise:0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
Permute          DS-CNN/conv_ds_1/dw_conv/depthwise__14 1 1 DS-CNN/conv_ds_1/dw_conv/depthwise:0 DS-CNN/conv_ds_1/dw_conv/depthwise__14:0 0=3
BinaryOp         DS-CNN/conv_ds_1/dw_conv/BiasAdd 2 1 DS-CNN/conv_ds_1/dw_conv/depthwise__14:0 DS-CNN/conv_ds_1/dw_conv/biases:0 DS-CNN/conv_ds_1/dw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__15 1 1 DS-CNN/conv_ds_1/dw_conv/BiasAdd:0 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__15:0 0=4
BatchNorm        DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__15:0 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__16 1 1 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__16:0 0=3
ReLU             DS-CNN/conv_ds_1/dw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_1/dw_conv/batch_norm/FusedBatchNorm__16:0 DS-CNN/conv_ds_1/dw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_1/pw_conv/Conv2D__17 1 1 DS-CNN/conv_ds_1/dw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_1/pw_conv/Conv2D__17:0 0=4
Convolution      DS-CNN/conv_ds_1/pw_conv/Conv2D 1 1 DS-CNN/conv_ds_1/pw_conv/Conv2D__17:0 DS-CNN/conv_ds_1/pw_conv/Conv2D:0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Permute          DS-CNN/conv_ds_1/pw_conv/Conv2D__18 1 1 DS-CNN/conv_ds_1/pw_conv/Conv2D:0 DS-CNN/conv_ds_1/pw_conv/Conv2D__18:0 0=3
BinaryOp         DS-CNN/conv_ds_1/pw_conv/BiasAdd 2 1 DS-CNN/conv_ds_1/pw_conv/Conv2D__18:0 DS-CNN/conv_ds_1/pw_conv/biases:0 DS-CNN/conv_ds_1/pw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__19 1 1 DS-CNN/conv_ds_1/pw_conv/BiasAdd:0 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__19:0 0=4
BatchNorm        DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__19:0 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__20 1 1 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__20:0 0=3
ReLU             DS-CNN/conv_ds_1/pw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_1/pw_conv/batch_norm/FusedBatchNorm__20:0 DS-CNN/conv_ds_1/pw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_2/dw_conv/depthwise__21 1 1 DS-CNN/conv_ds_1/pw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_2/dw_conv/depthwise__21:0 0=4
ConvolutionDepthWise DS-CNN/conv_ds_2/dw_conv/depthwise 1 1 DS-CNN/conv_ds_2/dw_conv/depthwise__21:0 DS-CNN/conv_ds_2/dw_conv/depthwise:0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
Permute          DS-CNN/conv_ds_2/dw_conv/depthwise__24 1 1 DS-CNN/conv_ds_2/dw_conv/depthwise:0 DS-CNN/conv_ds_2/dw_conv/depthwise__24:0 0=3
BinaryOp         DS-CNN/conv_ds_2/dw_conv/BiasAdd 2 1 DS-CNN/conv_ds_2/dw_conv/depthwise__24:0 DS-CNN/conv_ds_2/dw_conv/biases:0 DS-CNN/conv_ds_2/dw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__25 1 1 DS-CNN/conv_ds_2/dw_conv/BiasAdd:0 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__25:0 0=4
BatchNorm        DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__25:0 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__26 1 1 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__26:0 0=3
ReLU             DS-CNN/conv_ds_2/dw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_2/dw_conv/batch_norm/FusedBatchNorm__26:0 DS-CNN/conv_ds_2/dw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_2/pw_conv/Conv2D__27 1 1 DS-CNN/conv_ds_2/dw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_2/pw_conv/Conv2D__27:0 0=4
Convolution      DS-CNN/conv_ds_2/pw_conv/Conv2D 1 1 DS-CNN/conv_ds_2/pw_conv/Conv2D__27:0 DS-CNN/conv_ds_2/pw_conv/Conv2D:0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Permute          DS-CNN/conv_ds_2/pw_conv/Conv2D__28 1 1 DS-CNN/conv_ds_2/pw_conv/Conv2D:0 DS-CNN/conv_ds_2/pw_conv/Conv2D__28:0 0=3
BinaryOp         DS-CNN/conv_ds_2/pw_conv/BiasAdd 2 1 DS-CNN/conv_ds_2/pw_conv/Conv2D__28:0 DS-CNN/conv_ds_2/pw_conv/biases:0 DS-CNN/conv_ds_2/pw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__29 1 1 DS-CNN/conv_ds_2/pw_conv/BiasAdd:0 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__29:0 0=4
BatchNorm        DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__29:0 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__30 1 1 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__30:0 0=3
ReLU             DS-CNN/conv_ds_2/pw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_2/pw_conv/batch_norm/FusedBatchNorm__30:0 DS-CNN/conv_ds_2/pw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_3/dw_conv/depthwise__31 1 1 DS-CNN/conv_ds_2/pw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_3/dw_conv/depthwise__31:0 0=4
ConvolutionDepthWise DS-CNN/conv_ds_3/dw_conv/depthwise 1 1 DS-CNN/conv_ds_3/dw_conv/depthwise__31:0 DS-CNN/conv_ds_3/dw_conv/depthwise:0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
Permute          DS-CNN/conv_ds_3/dw_conv/depthwise__34 1 1 DS-CNN/conv_ds_3/dw_conv/depthwise:0 DS-CNN/conv_ds_3/dw_conv/depthwise__34:0 0=3
BinaryOp         DS-CNN/conv_ds_3/dw_conv/BiasAdd 2 1 DS-CNN/conv_ds_3/dw_conv/depthwise__34:0 DS-CNN/conv_ds_3/dw_conv/biases:0 DS-CNN/conv_ds_3/dw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__35 1 1 DS-CNN/conv_ds_3/dw_conv/BiasAdd:0 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__35:0 0=4
BatchNorm        DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__35:0 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__36 1 1 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__36:0 0=3
ReLU             DS-CNN/conv_ds_3/dw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_3/dw_conv/batch_norm/FusedBatchNorm__36:0 DS-CNN/conv_ds_3/dw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_3/pw_conv/Conv2D__37 1 1 DS-CNN/conv_ds_3/dw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_3/pw_conv/Conv2D__37:0 0=4
Convolution      DS-CNN/conv_ds_3/pw_conv/Conv2D 1 1 DS-CNN/conv_ds_3/pw_conv/Conv2D__37:0 DS-CNN/conv_ds_3/pw_conv/Conv2D:0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Permute          DS-CNN/conv_ds_3/pw_conv/Conv2D__38 1 1 DS-CNN/conv_ds_3/pw_conv/Conv2D:0 DS-CNN/conv_ds_3/pw_conv/Conv2D__38:0 0=3
BinaryOp         DS-CNN/conv_ds_3/pw_conv/BiasAdd 2 1 DS-CNN/conv_ds_3/pw_conv/Conv2D__38:0 DS-CNN/conv_ds_3/pw_conv/biases:0 DS-CNN/conv_ds_3/pw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__39 1 1 DS-CNN/conv_ds_3/pw_conv/BiasAdd:0 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__39:0 0=4
BatchNorm        DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__39:0 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__40 1 1 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__40:0 0=3
ReLU             DS-CNN/conv_ds_3/pw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_3/pw_conv/batch_norm/FusedBatchNorm__40:0 DS-CNN/conv_ds_3/pw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_4/dw_conv/depthwise__41 1 1 DS-CNN/conv_ds_3/pw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_4/dw_conv/depthwise__41:0 0=4
ConvolutionDepthWise DS-CNN/conv_ds_4/dw_conv/depthwise 1 1 DS-CNN/conv_ds_4/dw_conv/depthwise__41:0 DS-CNN/conv_ds_4/dw_conv/depthwise:0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
Permute          DS-CNN/conv_ds_4/dw_conv/depthwise__44 1 1 DS-CNN/conv_ds_4/dw_conv/depthwise:0 DS-CNN/conv_ds_4/dw_conv/depthwise__44:0 0=3
BinaryOp         DS-CNN/conv_ds_4/dw_conv/BiasAdd 2 1 DS-CNN/conv_ds_4/dw_conv/depthwise__44:0 DS-CNN/conv_ds_4/dw_conv/biases:0 DS-CNN/conv_ds_4/dw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__45 1 1 DS-CNN/conv_ds_4/dw_conv/BiasAdd:0 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__45:0 0=4
BatchNorm        DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__45:0 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__46 1 1 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__46:0 0=3
ReLU             DS-CNN/conv_ds_4/dw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_4/dw_conv/batch_norm/FusedBatchNorm__46:0 DS-CNN/conv_ds_4/dw_conv/batch_norm/Relu:0
Permute          DS-CNN/conv_ds_4/pw_conv/Conv2D__47 1 1 DS-CNN/conv_ds_4/dw_conv/batch_norm/Relu:0 DS-CNN/conv_ds_4/pw_conv/Conv2D__47:0 0=4
Convolution      DS-CNN/conv_ds_4/pw_conv/Conv2D 1 1 DS-CNN/conv_ds_4/pw_conv/Conv2D__47:0 DS-CNN/conv_ds_4/pw_conv/Conv2D:0 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Permute          DS-CNN/conv_ds_4/pw_conv/Conv2D__48 1 1 DS-CNN/conv_ds_4/pw_conv/Conv2D:0 DS-CNN/conv_ds_4/pw_conv/Conv2D__48:0 0=3
BinaryOp         DS-CNN/conv_ds_4/pw_conv/BiasAdd 2 1 DS-CNN/conv_ds_4/pw_conv/Conv2D__48:0 DS-CNN/conv_ds_4/pw_conv/biases:0 DS-CNN/conv_ds_4/pw_conv/BiasAdd:0 0=0
Permute          DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__49 1 1 DS-CNN/conv_ds_4/pw_conv/BiasAdd:0 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__49:0 0=4
BatchNorm        DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm 1 1 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__49:0 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm:0 0=64
Permute          DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__50 1 1 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm:0 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__50:0 0=3
ReLU             DS-CNN/conv_ds_4/pw_conv/batch_norm/Relu 1 1 DS-CNN/conv_ds_4/pw_conv/batch_norm/FusedBatchNorm__50:0 DS-CNN/conv_ds_4/pw_conv/batch_norm/Relu:0
Permute          DS-CNN/avg_pool/AvgPool__51 1 1 DS-CNN/conv_ds_4/pw_conv/batch_norm/Relu:0 DS-CNN/avg_pool/AvgPool__51:0 0=4
Pooling          DS-CNN/avg_pool/AvgPool  1 1 DS-CNN/avg_pool/AvgPool__51:0 DS-CNN/avg_pool/AvgPool:0 0=1 1=5 11=50 2=2 12=2 5=1 6=0
Permute          DS-CNN/avg_pool/AvgPool__52 1 1 DS-CNN/avg_pool/AvgPool:0 DS-CNN/avg_pool/AvgPool__52:0 0=3
Squeeze          DS-CNN/SpatialSqueeze    1 1 DS-CNN/avg_pool/AvgPool__52:0 DS-CNN/SpatialSqueeze:0 -23303=2,1,2
InnerProduct     DS-CNN/fc1/MatMul        1 1 DS-CNN/SpatialSqueeze:0 DS-CNN/fc1/MatMul:0 0=4 1=0 2=256
BinaryOp         DS-CNN/fc1/BiasAdd       2 1 DS-CNN/fc1/MatMul:0 DS-CNN/fc1/biases:0 DS-CNN/fc1/BiasAdd:0 0=0
Softmax          labels_softmax           1 1 DS-CNN/fc1/BiasAdd:0 labels_softmax_raw_output___3:0 0=0 1=1
